Revit 2024 API
ElementRecord.GetOwnerViewId Method
 Gets the element id of the owner view record.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId GetOwnerViewId()
Visual Basic
Public Function GetOwnerViewId As ElementId
Visual C++
public:
ElementId^ GetOwnerViewId()
Return Value
 The view record element id.
See Also
ElementRecord Class
Autodesk.Revit.DB Namespace